# MFF-YOLOv5s-4EL Model Configuration
# Integrates: SIoU, Decoupled Header, Small Object Detection Layer (P2), SimAM, C3Ghost

nc: 8  # number of classes (person, stone, coal, signal_light, left_light, right_light, turnout, electric_locomotive)
depth_multiple: 0.33  # YOLOv5s depth factor
width_multiple: 0.50  # YOLOv5s width factor

anchors:
  - [4,5, 8,10, 13,16]      # P2/4 - Small Object Detection Layer (160×160 feature map)
  - [10,13, 16,30, 33,23]   # P3/8 - Medium objects (80×80)
  - [30,61, 62,45, 59,119]  # P4/16 - Large objects (40×40)
  - [116,90, 156,198, 373,326]  # P5/32 - Largest objects (20×20)

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],   # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],     # 1-P2/4
   [-1, 3, C3Ghost, [128]],        # 2
   [-1, 1, Conv, [256, 3, 2]],     # 3-P3/8
   [-1, 6, C3Ghost, [256]],        # 4
   [-1, 1, Conv, [512, 3, 2]],     # 5-P4/16
   [-1, 9, C3Ghost, [512]],        # 6
   [-1, 1, Conv, [1024, 3, 2]],    # 7-P5/32
   [-1, 3, C3Ghost, [1024]],       # 8
   [-1, 1, SPPF, [1024, 5]],       # 9
  ]

head:
  # P5 Head (20×20)
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],      # cat backbone P4
   [-1, 3, C3Ghost, [512, False]], # 13
   
   # P4 Head (40×40)
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],      # cat backbone P3
   [-1, 3, C3Ghost, [256, False]], # 17
   
   # P3 Head (80×80)
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],      # cat backbone P2
   [-1, 3, C3Ghost, [128, False]], # 21 - P2 Small Object Detection Layer
   
   # Decoupled Detection Heads with SimAM (activated in code)
   [[21, 17, 13, 9], 1, DecoupledDetect, [nc, anchors]],  # P2, P3, P4, P5
  ]